Revit 2026 API

# RebarInSystemArrayLength Property

---

Identifies the distribution path length of rebar set.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ArrayLength { get; }
```
```vb
Public ReadOnly Property ArrayLength As Double
	Get
```
```cpp
public:
property double ArrayLength {
	double get ();
}
```
```fsharp
member ArrayLength : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InapplicableDataException | This rebar element represents a single bar (the layout rule is Single). |

#### Reference

RebarInSystem Class

Autodesk.Revit.DB.Structure Namespace